In [8]:
import pandas as pd
from faker import Faker

In [10]:
filename = 'balances_test.csv' # please specify your file name here
df = pd.read_csv(filename)
faker = Faker()
faker.name()

'Danielle Porter'

In [11]:
df.head(3)

       debit  credit             acc_name
0  173444.09     NaN             acc name
1  200000.00     NaN              another
2  254922.34     NaN  another longer name

In [12]:
df = df.loc[:, :'acc_name']
df.head(3)

       debit  credit             acc_name
0  173444.09     NaN             acc name
1  200000.00     NaN              another
2  254922.34     NaN  another longer name

In [13]:
df.acc_name = df.acc_name.apply(lambda x: faker.name())
df

       debit  credit           acc_name
0  173444.09     NaN  Robert Pierce III
1  200000.00     NaN     Patricia David
2  254922.34     NaN     Alexander King
3  231016.83     NaN        Mike Martin
4  132681.25     NaN        Craig Clark

In [14]:
df.acc_name = df.acc_name + " - Bank"

In [15]:
df.head()

       debit  credit                  acc_name
0  173444.09     NaN  Robert Pierce III - Bank
1  200000.00     NaN     Patricia David - Bank
2  254922.34     NaN     Alexander King - Bank
3  231016.83     NaN        Mike Martin - Bank
4  132681.25     NaN        Craig Clark - Bank

In [16]:
df.to_csv(path_or_buf='test_pandas.csv', index=False)